import changeLang from './setting/fun-change_lang.js';
import createSlider from './components/slider/createSlider.js';
import slider from './components/slider/slider.js';
import createAccordion from './components/accordion/createAccordion.js';
import accordion from './components/accordion/accordion.js';
import createDescription from './components/description/createDescription.js';
import createForm from './components/form/createForm.js';
import form from './components/form/form.js';

document.addEventListener('DOMContentLoaded', () => {
    createSlider({
        arr: [
            {
                order: 0,
                imges: {
                    img: ['./img/slide/1/slide-1.webp', './img/slide/1/slide-2.webp', './img/slide/1/slide-3.webp', './img/slide/1/slide-4.webp'],
                    alt: {
                        'ru' : 'картинка кровля загородного дома',
                        'uk' : 'зображення покрівля заміського будинку',
                    }
                },
                type: {
                    'ru' : 'Кровля загородного дома',
                    'uk' : 'Покрівля заміського будинку',
                },
                info_ru: ['Площадь утепление - 130м2', 'Срок выполнения - 8 часов*', 'Толщина утеления - 150мм'],
                info_uk: ['Площа утеплення – 130м2', 'Термін виконання – 8 годин*', 'Товщина втілення - 150мм'],
                btn: 'Рассчитать стоимость',
                footnote: {
                    'ru': '*После всех подготовительных работ',
                    'uk': '*Після всіх підготовчих робіт',
                }
            },
            {
                order: 1,
                imges: {
                    img: ['./img/slide/2/slide-1.webp', './img/slide/2/slide-2.webp', './img/slide/2/slide-3.webp', './img/slide/2/slide-4.webp'],
                    alt: {
                        'ru' : 'картинка Ферма',
                        'uk' : 'зображення Ферма',
                    }
                },
                type: {
                    'ru' : 'Ферма',
                    'uk' : 'Ферма',
                },
                info_ru: ['Площадь утепление - 470м2', 'Срок выполнения - 1 день*', 'Толщина утеления - 50мм'],
                info_uk: ['Площа утеплення – 470м2', 'Термін виконання – 1 день*', 'Товщина втілення - 50мм'],
                btn: 'Рассчитать стоимость',
                footnote: {
                    'ru': '*После всех подготовительных работ',
                    'uk': '*Після всіх підготовчих робіт',
                }
            },
            {
                order: 2,
                imges: {
                    img: ['./img/slide/3/slide-1.webp', './img/slide/3/slide-2.webp', './img/slide/3/slide-3.webp', './img/slide/3/slide-4.webp'],
                    alt: {
                        'ru' : 'картинка Купольный дом',
                        'uk' : 'зображення Купольный дом',
                    }
                },
                type: {
                    'ru' : 'Купольный дом',
                    'uk' : 'Купольний дiм',
                },
                info_ru: ['Площадь утепление - 280м2', 'Срок выполнения - 2 дня*', 'Толщина утеления - 100мм'],
                info_uk: ['Площа утеплення – 280м2', 'Термін виконання – 2 дні*', 'Товщина втілення - 100мм'],
                btn: 'Рассчитать стоимость',
                footnote: {
                    'ru': '*После всех подготовительных работ',
                    'uk': '*Після всіх підготовчих робіт',
                }
            }
        ],
        funSlider: () => {
            slider({
                act: [1,2,3]
            })
        }
    });

    createDescription({
        arr: [
            {
                info_ru: ['Активно применяется в Канаде, США и Европе.', 'ППУ экологически безопасен.', 'Утепление пенополиуретаном не требует применения крепежей.', 'У пенополиуретана самая низкая теплопроводность среди утеплителей.', 'ППУ– это негорючий материал.', 'Долговечность пенополиуретана сравнима со сроком жизни Вашего дома и составляет не менее 50 лет.', 'Бесшовный слой ППУ без стыков позволяет в 2 раза уменьшить потери тепла.', 'Пенополиуретаном можно утеплить абсолютно любую конструкцию.', 'На сегодняшний день ППУ — самый энергоэффективный утеплитель в мире.'],
                info_uk: ['Активно застосовується у Канаді, США та Європі.', 'ППУ є екологічно безпечним.', 'Утеплення пінополіуретаном не потребує застосування кріплень.', 'У пінополіуретану найнижча теплопровідність серед утеплювачів.', 'ППУ – це негорючий матеріал.', 'Довговічність пінополіуретану можна порівняти з терміном життя Вашого будинку і становить не менше 50 років.', 'Безшовний шар ППУ без стиків дозволяє вдвічі зменшити втрати тепла.', 'Пінополіуретаном можна утеплити будь-яку конструкцію.Пенополиуретаном можно утеплить абсолютно любую конструкцию.', 'На сьогоднішній день ППУ — найенергоефективніший утеплювач у світі.'],
            }
        ]
    });

    createAccordion({
        arr: [
            {
                order: 1,
                FAQ_ru: [
                    {
                        title: 'Можно ли самому нанести ППУ?',
                        info: 'Метод предполагает наличие профессионального оборудования высокого давления и знаний по напылению ППУ. Лучше пригласить профессионалов и сэкономить деньги и время.',
                    },
                    {
                        title: 'Пенополеуритан горит?',
                        info: 'Пенополиуретан не поддерживает горение, т е. является самозатухающим материалом с классом горючести Г2.',
                    },
                    {
                        title: 'Заводятся ли насекомые и грызуны?',
                        info: 'Грызуны и муравьи не используют материал в качестве пищи. Прогрызть нору способны, но жить там не будут, так как в ппу находится углекислый газ и нора становиться газовой термокамерой.',
                    },
                    {
                        title: 'ППУ Безопасный материал?',
                        info: 'Пенополиуретан является одним из самых безопасных и экологически чистых. Это подтверждено множеством испытаний и многолетней практикой эксплуатации этого утеплителя. Материал разрешен для использования в конструкции холодильников и бойлеров, находящихся в контакте с пищевыми продуктами.',
                    },
                ],
                FAQ_uk: [
                    {
                        title: 'Чи можна самому нанести ППУ?',
                        info: 'Метод передбачає наявність професійного обладнання високого тиску та знань із напилення ППУ. Краще запросити професіоналів та заощадити гроші та час.',
                    },
                    {
                        title: 'Чи горить пінополеуритан?',
                        info: 'Пінополіуретан не підтримує горіння, тобто є самозагасаючим матеріалом з класом горючості Г2.',
                    },
                    {
                        title: 'Чи заводяться комахи та гризуни?',
                        info: 'Гризуни та мурахи не використовують матеріал як їжу. Прогризти нору здатні, але жити там не будуть, тому що у ппу знаходиться вуглекислий газ і нора ставати газовою термокамерою.',
                    },
                    {
                        title: 'ППУ Безпечний матеріал?',
                        info: 'Пінополіуретан є одним з найбезпечніших та екологічно чистих. Це підтверджено безліччю випробувань та багаторічною практикою експлуатації цього утеплювача. Матеріал дозволено для використання в конструкції холодильників та бойлерів, що перебувають у контакті з харчовими продуктами.',
                    },
                ]
            },
            {
                order: 2,
                FAQ_ru: [
                    {
                        title: 'Как правильно выбрать плотность?',
                        info: 'Плотность пенополиуретана выбирается исходя из утепляемой конструкции. Лучше свяжитесь с нашими специалистами, они подберут плотность под задачу.',
                    },
                    {
                        title: 'Какой срок службы ППУ?',
                        info: 'Плотность пенополиуретана выбирается исходя из утепляемой конструкции. Лучше свяжитесь с нашими специалистами, они подберут плотность под задачу.',
                    },
                    {
                        title: 'ППУ боится воды?',
                        info: 'Воды не боится. Даже открытоячеистый ппу при комнатной температуре высохнет и будет работать. Но устранять вопросы гидроизоляции должен не утеплитель.',
                    },
                    {
                        title: 'Минусы ППУ?',
                        info: 'Самый главный минус это технологичность. На втором месте идет разрушение от ультрафиолетовых лучей. При теплоизоляции снаружи надо обязательно предусмотреть его защиту.',
                    },
                ],
                FAQ_uk: [
                    {
                        title: 'Як правильно обрати густину?',
                        info: 'Щільність пінополіуретану вибирається виходячи з конструкції, що утеплюється. Краще зв`яжіться з нашими фахівцями, вони підберуть густину під завдання.',
                    },
                    {
                        title: 'Який термін служби ППУ?',
                        info: 'Час служби понад 50 років, у той час як мінеральна вата погіршить теплоізоляційні характеристики в 2 рази вже через 5-8 років експлуатації та вимагатиме заміни.',
                    },
                    {
                        title: 'ППУ боїться води?',
                        info: 'Води не боїться. Навіть відкритокомірчастий ппу при кімнатній температурі висохне і працюватиме. Але усувати питання гідроізоляції має не утеплювач.',
                    },
                    {
                        title: 'Мінуси ППУ?',
                        info: 'Найголовніший мінус – це технологічність. На другому місці йде руйнація від ультрафіолетового проміння. При теплоізоляції зовні необхідно обов`язково передбачити його захист.',
                    },
                ]
            }
        ],
        funAccordion: () => {
            accordion();
        }
    });

    createForm({
        arr: [
            {
                name: ['name', 'phone', 'email'],
                type: ['text', 'number', 'email'],
                info_ru: ['Имя', 'Телефон', 'Почта'],
                info_uk: ['Ім`я', 'Телефон', 'Пошта']
            }
        ],
        funForm: () => {
            form({
                rules: {
                    name: /^(([A-Za-z]|[А-Яа-я]){2,10})$/,
                    email: /^([a-zA-Z0-9\_.-])+\@(([a-zA-Z0-9\-])+\.)+([a-zA-Z0-9]{2,4})$/, 
                    phone: /^(([0-9]){7,12})$/
                },
                servis : ['telegram', 'google'],
                forms: [
                    {
                        'telegram': {
                            TOKIN: '5288793147:AAHBWe1abCXXvGZ1V1UgqvYH1m56OGd34VI',
                            chatID: '-631831970',
                            URLs: {
                                url: 'https://api.telegram.org/bot',
                                chat: '/sendMessage?chat_id=',
                                type: '&text='
                            }
                        }
                    }
                ]
            })
        }
    });
    
    changeLang({
        obj : {
            'text' : {
                'title' : {
                    'ru' : 'Теплый дом - Утепление пенополиуретаном',
                    'uk' : 'Теплий будинок - Утеплення пінополіуретаном'
                },
                'work' : {
                    'ru' : 'Работа',
                    'uk' : 'Робота',
                },
                'contacts' : {
                    'ru' : 'Контакты',
                    'uk' : 'Контакти',
                },
                'btn_calculate' : {
                    'ru' : 'Рассчитать стоимость',
                    'uk' : 'Розрахувати вартість',
                },
                'btn_connection' : {
                    'ru' : 'Оставить заявку',
                    'uk' : 'Залишити заявку',
                },
                'kinds-work_title' : {
                    'ru' : 'Что можно утеплить при помощи ППУ',
                    'uk' : 'Що можна утеплити за допомогою ППУ',
                },
                'description-info_text-0' : {
                    'ru' : 'Жилые дома',
                    'uk' : 'Житлові будинки',
                },
                'description-info_text-1' : {
                    'ru' : 'Коммерческие здания',
                    'uk' : 'Комерційні будинки',
                },
                'description-info_text-2' : {
                    'ru' : 'Резервуары и цестерны',
                    'uk' : 'Резервуари та цестерни',
                },
                'description-info_text-3' : {
                    'ru' : 'Склады и ангары',
                    'uk' : 'Склади та ангари',
                },
                'content-header_info' : {
                    'ru' : 'Снижение расходов на отопление дома на 40%',
                    'uk' : 'Зниження витрат на опалення будинку на 40%',
                },
                'content-header_question' : {
                    'ru' : 'Почему стоит выбрать пенополиуретан (ППУ)?',
                    'uk' : 'Чому варто обрати пінополіуретан (ППУ)?',
                },
                'questions-content_title' : {
                    'ru' : 'Часто задаваемые вопросы',
                    'uk' : 'Часті питання',
                },
                'content_intro-title' : {
                    'ru' : 'Нет времени разбираться?',
                    'uk' : 'Нема часу розбиратися?',
                },
                'content_intro-help' : {
                    'ru' : 'Наши специалисты помогут',
                    'uk' : 'Наші спеціалісти допоможуть',
                },
                'btn_order': {
                    'ru': 'Связаться в Telegram',
                    'uk' : 'Зв`язатися у Telegram',
                },
                'btn_write': {
                    'ru': 'Связаться в Viber',
                    'uk' : 'Зв`язатися у Viber',
                },
                'content-form_intro-help' : {
                    'ru': 'Контакты',
                    'uk' : 'Контакти',
                },
                'content-form_intro-phone' : {
                    'ru': 'Телефон:',
                    'uk' : 'Телефон:',
                },
                'content-form_intro-mail' : {
                    'ru': 'Почта:',
                    'uk' : 'Пошта:',
                },
                'content-form_intro-form' : {
                    'ru': 'Оставьте заявку',
                    'uk' : 'Залишіть заявку',
                },
                'content-form_intro-warning' : {
                    'ru': 'Отправляя запрос вы соглашаетесь с политикой конфиденциальности',
                    'uk' : 'Надсилаючи запит ви погоджуєтеся з політикою конфіденційності',
                },
                'content-form_intro-btn' : {
                    'ru': 'Отправить',
                    'uk' : 'Надiслати',
                }
            },
            'html' : {
                'logo' : {
                    'ru' : `
                        <svg width="195" height="38" viewBox="0 0 195 38" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M26.2036 6.67188V28H21.8237V6.67188H26.2036ZM32.7661 6.67188V10.1143H15.3638V6.67188H32.7661ZM40.9253 28.293C39.6948 28.293 38.5913 28.0977 37.6147 27.707C36.6382 27.3066 35.8081 26.7549 35.1245 26.0518C34.4507 25.3486 33.9331 24.5332 33.5718 23.6055C33.2104 22.668 33.0298 21.6719 33.0298 20.6172V20.0312C33.0298 18.8301 33.2007 17.7314 33.5425 16.7354C33.8843 15.7393 34.3726 14.875 35.0073 14.1426C35.6519 13.4102 36.4331 12.8486 37.3511 12.458C38.269 12.0576 39.3042 11.8574 40.4565 11.8574C41.5796 11.8574 42.5757 12.043 43.4448 12.4141C44.314 12.7852 45.0415 13.3125 45.6274 13.9961C46.2231 14.6797 46.6724 15.5 46.9751 16.457C47.2778 17.4043 47.4292 18.459 47.4292 19.6211V21.3789H34.8315V18.5664H43.2837V18.2441C43.2837 17.6582 43.1763 17.1357 42.9614 16.6768C42.7563 16.208 42.4438 15.8369 42.0239 15.5635C41.604 15.29 41.0669 15.1533 40.4126 15.1533C39.856 15.1533 39.3774 15.2754 38.9771 15.5195C38.5767 15.7637 38.2495 16.1055 37.9956 16.5449C37.7515 16.9844 37.5659 17.502 37.439 18.0977C37.3218 18.6836 37.2632 19.3281 37.2632 20.0312V20.6172C37.2632 21.252 37.3511 21.8379 37.5269 22.375C37.7124 22.9121 37.9712 23.376 38.3032 23.7666C38.645 24.1572 39.0552 24.46 39.5337 24.6748C40.022 24.8896 40.5737 24.9971 41.189 24.9971C41.9507 24.9971 42.6587 24.8506 43.313 24.5576C43.9771 24.2549 44.5483 23.8008 45.0269 23.1953L47.0776 25.4219C46.7456 25.9004 46.2915 26.3594 45.7153 26.7988C45.1489 27.2383 44.4653 27.5996 43.6646 27.8828C42.8638 28.1562 41.9507 28.293 40.9253 28.293ZM60.4956 12.1504V15.4609H52.8198V12.1504H60.4956ZM54.0356 12.1504V28H49.8169V12.1504H54.0356ZM63.5718 12.1504V28H59.3384V12.1504H63.5718ZM77.4878 12.1504V15.4609H69.6948V12.1504H77.4878ZM80.5786 12.1504V28H76.3599V12.1504H80.5786ZM68.6401 12.1504H72.7856L72.3608 20.1484C72.3022 21.291 72.1802 22.2969 71.9946 23.166C71.8091 24.0352 71.5601 24.7773 71.2476 25.3926C70.9448 26.0078 70.5786 26.5107 70.1489 26.9014C69.729 27.2822 69.2358 27.5605 68.6694 27.7363C68.1128 27.9121 67.4976 28 66.8237 28H65.5347L65.4907 24.6748L66.0327 24.6162C66.3452 24.5869 66.6187 24.499 66.853 24.3525C67.0972 24.1963 67.3022 23.9766 67.4683 23.6934C67.644 23.4004 67.7905 23.0342 67.9077 22.5947C68.0249 22.1455 68.1177 21.6182 68.186 21.0127C68.2642 20.4072 68.3179 19.709 68.3472 18.918L68.6401 12.1504ZM86.7603 16.8525H91.3599C92.8052 16.8525 94.0356 17.0918 95.0513 17.5703C96.0767 18.0391 96.8579 18.6934 97.395 19.5332C97.9419 20.373 98.2153 21.3447 98.2153 22.4482C98.2153 23.249 98.0591 23.9912 97.7466 24.6748C97.4438 25.3486 96.9995 25.9346 96.4136 26.4326C95.8276 26.9307 95.1099 27.3164 94.2603 27.5898C93.4106 27.8633 92.4438 28 91.3599 28H84.1235V12.1504H88.3569V24.7188H91.3599C91.9946 24.7188 92.5024 24.6162 92.8833 24.4111C93.2739 24.1963 93.5571 23.918 93.7329 23.5762C93.9185 23.2344 94.0112 22.8633 94.0112 22.4629C94.0112 22.043 93.9185 21.6621 93.7329 21.3203C93.5571 20.9688 93.2739 20.6855 92.8833 20.4707C92.5024 20.2559 91.9946 20.1484 91.3599 20.1484H86.7603V16.8525ZM104.983 12.1504V28H100.764V12.1504H104.983ZM112.893 22.1113L118.21 12.1504H122.429V28H118.21V18.0244L112.893 28H108.674V12.1504H112.893V22.1113ZM117.727 5.77832H120.73C120.73 6.61816 120.52 7.36523 120.1 8.01953C119.69 8.66406 119.104 9.17188 118.342 9.54297C117.581 9.9043 116.682 10.085 115.647 10.085C114.075 10.085 112.83 9.68457 111.912 8.88379C111.003 8.08301 110.549 7.04785 110.549 5.77832H113.538C113.538 6.28613 113.694 6.74023 114.006 7.14062C114.329 7.54102 114.875 7.74121 115.647 7.74121C116.409 7.74121 116.946 7.54102 117.258 7.14062C117.571 6.74023 117.727 6.28613 117.727 5.77832ZM136.008 12.1504H140.227L140.095 17.4531C140.056 19.1523 139.861 20.6123 139.509 21.833C139.158 23.0537 138.689 24.0791 138.103 24.9092C137.517 25.7393 136.848 26.4033 136.096 26.9014C135.354 27.3896 134.573 27.7559 133.752 28H132.961L132.917 24.748L133.357 24.7041C133.855 24.1865 134.265 23.6836 134.587 23.1953C134.91 22.6973 135.159 22.1748 135.334 21.6279C135.51 21.0811 135.637 20.4707 135.715 19.7969C135.803 19.123 135.857 18.3418 135.876 17.4531L136.008 12.1504ZM137.151 12.1504H147.654V28H143.45V15.5342H137.151V12.1504ZM131.995 24.7041H149.924V32.7607H145.706V28H136.316V32.7607H131.995V24.7041ZM151.404 20.2363V19.9287C151.404 18.7666 151.57 17.6973 151.902 16.7207C152.234 15.7344 152.717 14.8799 153.352 14.1572C153.987 13.4346 154.768 12.873 155.696 12.4727C156.624 12.0625 157.688 11.8574 158.889 11.8574C160.09 11.8574 161.16 12.0625 162.097 12.4727C163.035 12.873 163.821 13.4346 164.456 14.1572C165.1 14.8799 165.588 15.7344 165.92 16.7207C166.252 17.6973 166.418 18.7666 166.418 19.9287V20.2363C166.418 21.3887 166.252 22.458 165.92 23.4443C165.588 24.4209 165.1 25.2754 164.456 26.0078C163.821 26.7305 163.04 27.292 162.112 27.6924C161.184 28.0928 160.12 28.293 158.918 28.293C157.717 28.293 156.648 28.0928 155.71 27.6924C154.783 27.292 153.997 26.7305 153.352 26.0078C152.717 25.2754 152.234 24.4209 151.902 23.4443C151.57 22.458 151.404 21.3887 151.404 20.2363ZM155.623 19.9287V20.2363C155.623 20.9004 155.681 21.5205 155.798 22.0967C155.916 22.6729 156.101 23.1807 156.355 23.6201C156.619 24.0498 156.96 24.3867 157.38 24.6309C157.8 24.875 158.313 24.9971 158.918 24.9971C159.504 24.9971 160.007 24.875 160.427 24.6309C160.847 24.3867 161.184 24.0498 161.438 23.6201C161.692 23.1807 161.877 22.6729 161.995 22.0967C162.122 21.5205 162.185 20.9004 162.185 20.2363V19.9287C162.185 19.2842 162.122 18.6787 161.995 18.1123C161.877 17.5361 161.687 17.0283 161.423 16.5889C161.169 16.1396 160.833 15.7881 160.413 15.5342C159.993 15.2803 159.485 15.1533 158.889 15.1533C158.293 15.1533 157.786 15.2803 157.366 15.5342C156.956 15.7881 156.619 16.1396 156.355 16.5889C156.101 17.0283 155.916 17.5361 155.798 18.1123C155.681 18.6787 155.623 19.2842 155.623 19.9287ZM178.65 23.1514L182.81 12.1504H186.252L180.071 28H177.229L171.077 12.1504H174.519L178.65 23.1514ZM173.508 12.1504V28H169.29V12.1504H173.508ZM183.894 28V12.1504H188.113V28H183.894Z" fill="white"/>
                            <path d="M12.3449 30.5567V16.0117L0 23.0398V37.5237L12.3449 30.5567Z" fill="#F89862"/>
                            <path d="M12.3449 14.545V0L0 7.02805V21.5119L12.3449 14.545Z" fill="#7DD824"/>
                        </svg>`,
                    'uk' : `
                        <svg width="195" height="38" viewBox="0 0 195 38" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M26.2041 6.67188V28H21.8242V6.67188H26.2041ZM32.7666 6.67188V10.1143H15.3643V6.67188H32.7666ZM40.9258 28.293C39.6953 28.293 38.5918 28.0977 37.6152 27.707C36.6387 27.3066 35.8086 26.7549 35.125 26.0518C34.4512 25.3486 33.9336 24.5332 33.5723 23.6055C33.2109 22.668 33.0303 21.6719 33.0303 20.6172V20.0312C33.0303 18.8301 33.2012 17.7314 33.543 16.7354C33.8848 15.7393 34.373 14.875 35.0078 14.1426C35.6523 13.4102 36.4336 12.8486 37.3516 12.458C38.2695 12.0576 39.3047 11.8574 40.457 11.8574C41.5801 11.8574 42.5762 12.043 43.4453 12.4141C44.3145 12.7852 45.042 13.3125 45.6279 13.9961C46.2236 14.6797 46.6729 15.5 46.9756 16.457C47.2783 17.4043 47.4297 18.459 47.4297 19.6211V21.3789H34.832V18.5664H43.2842V18.2441C43.2842 17.6582 43.1768 17.1357 42.9619 16.6768C42.7568 16.208 42.4443 15.8369 42.0244 15.5635C41.6045 15.29 41.0674 15.1533 40.4131 15.1533C39.8564 15.1533 39.3779 15.2754 38.9775 15.5195C38.5771 15.7637 38.25 16.1055 37.9961 16.5449C37.752 16.9844 37.5664 17.502 37.4395 18.0977C37.3223 18.6836 37.2637 19.3281 37.2637 20.0312V20.6172C37.2637 21.252 37.3516 21.8379 37.5273 22.375C37.7129 22.9121 37.9717 23.376 38.3037 23.7666C38.6455 24.1572 39.0557 24.46 39.5342 24.6748C40.0225 24.8896 40.5742 24.9971 41.1895 24.9971C41.9512 24.9971 42.6592 24.8506 43.3135 24.5576C43.9775 24.2549 44.5488 23.8008 45.0273 23.1953L47.0781 25.4219C46.7461 25.9004 46.292 26.3594 45.7158 26.7988C45.1494 27.2383 44.4658 27.5996 43.665 27.8828C42.8643 28.1562 41.9512 28.293 40.9258 28.293ZM60.4961 12.1504V15.4609H52.8203V12.1504H60.4961ZM54.0361 12.1504V28H49.8174V12.1504H54.0361ZM63.5723 12.1504V28H59.3389V12.1504H63.5723ZM77.4883 12.1504V15.4609H69.6953V12.1504H77.4883ZM80.5791 12.1504V28H76.3604V12.1504H80.5791ZM68.6406 12.1504H72.7861L72.3613 20.1484C72.3027 21.291 72.1807 22.2969 71.9951 23.166C71.8096 24.0352 71.5605 24.7773 71.248 25.3926C70.9453 26.0078 70.5791 26.5107 70.1494 26.9014C69.7295 27.2822 69.2363 27.5605 68.6699 27.7363C68.1133 27.9121 67.498 28 66.8242 28H65.5352L65.4912 24.6748L66.0332 24.6162C66.3457 24.5869 66.6191 24.499 66.8535 24.3525C67.0977 24.1963 67.3027 23.9766 67.4688 23.6934C67.6445 23.4004 67.791 23.0342 67.9082 22.5947C68.0254 22.1455 68.1182 21.6182 68.1865 21.0127C68.2646 20.4072 68.3184 19.709 68.3477 18.918L68.6406 12.1504ZM88.0498 22.1113L93.3672 12.1504H97.5859V28H93.3672V18.0244L88.0498 28H83.8311V12.1504H88.0498V22.1113ZM105.042 22.1113L110.359 12.1504H114.578V28H110.359V18.0244L105.042 28H100.823V12.1504H105.042V22.1113ZM109.876 5.77832H112.879C112.879 6.61816 112.669 7.36523 112.249 8.01953C111.839 8.66406 111.253 9.17188 110.491 9.54297C109.729 9.9043 108.831 10.085 107.796 10.085C106.224 10.085 104.979 9.68457 104.061 8.88379C103.152 8.08301 102.698 7.04785 102.698 5.77832H105.687C105.687 6.28613 105.843 6.74023 106.155 7.14062C106.478 7.54102 107.024 7.74121 107.796 7.74121C108.558 7.74121 109.095 7.54102 109.407 7.14062C109.72 6.74023 109.876 6.28613 109.876 5.77832ZM128.157 12.1504H132.376L132.244 17.4531C132.205 19.1523 132.01 20.6123 131.658 21.833C131.307 23.0537 130.838 24.0791 130.252 24.9092C129.666 25.7393 128.997 26.4033 128.245 26.9014C127.503 27.3896 126.722 27.7559 125.901 28H125.11L125.066 24.748L125.506 24.7041C126.004 24.1865 126.414 23.6836 126.736 23.1953C127.059 22.6973 127.308 22.1748 127.483 21.6279C127.659 21.0811 127.786 20.4707 127.864 19.7969C127.952 19.123 128.006 18.3418 128.025 17.4531L128.157 12.1504ZM129.3 12.1504H139.803V28H135.599V15.5342H129.3V12.1504ZM124.144 24.7041H142.073V32.7607H137.854V28H128.465V32.7607H124.144V24.7041ZM148.68 12.1504V28H144.446V12.1504H148.68ZM144.183 8.01953C144.183 7.4043 144.397 6.89648 144.827 6.49609C145.257 6.0957 145.833 5.89551 146.556 5.89551C147.269 5.89551 147.84 6.0957 148.27 6.49609C148.709 6.89648 148.929 7.4043 148.929 8.01953C148.929 8.63477 148.709 9.14258 148.27 9.54297C147.84 9.94336 147.269 10.1436 146.556 10.1436C145.833 10.1436 145.257 9.94336 144.827 9.54297C144.397 9.14258 144.183 8.63477 144.183 8.01953ZM161.805 23.1514L165.965 12.1504H169.407L163.226 28H160.384L154.231 12.1504H157.674L161.805 23.1514ZM156.663 12.1504V28H152.444V12.1504H156.663ZM167.049 28V12.1504H171.268V28H167.049Z" fill="white"/>
                            <path d="M12.3449 30.5567V16.0117L0 23.0398V37.5237L12.3449 30.5567Z" fill="#F89862"/>
                            <path d="M12.3449 14.545V0L0 7.02805V21.5119L12.3449 14.545Z" fill="#7DD824"/>
                        </svg>        
                    `
                },
                'title_main' : {
                    'ru' : 'Утепление пенополиуретаном от <span class="colortext">100м2</span> с гарантией',
                    'uk' : 'Утеплення пінополіуретаном вiд <span class="colortext">100м2</span> з гарантією '
                },
                'title_info' : {
                    'ru' : 'Рассчитайте стоимост и получите технологическое обследовани <span class="colortext">БЕСПЛАТНО</span>',
                    'uk' : 'Розрахуйте вартість та отримайте технологічне обстеження <span class="colortext">БЕЗКОШТОВНО</span>',
                },
                'show-content_title' : {
                    'ru' : 'Утепляем уже более <span class="colortext">8 лет</span>',
                    'uk' : 'Утеплюємо вже понад <span class="colortext">8 рокiв</span>'
                }
            },
            'attr' : {
                'src' : {
                    'content-info_img' : {
                        'ru' : './img/constructor_lng/ru.webp',
                        'uk' : './img/constructor_lng/uk.webp'
                    },
                },
                'alt' : {
                    'content-info_img' : {
                        'ru' : 'схема материалов: Пенополиуретан - 20 мм, Экструдированный пенополистирол - 30 мм, Пенопласт - 40 мм, Минеральная вата - 45 мм, Полистиролбетон - 120 мм, Древесный брус - 180 мм, Красный кирпич - 560 мм, Бетонный блок - 1300 мм',
                        'uk' : 'схема матеріалів: Пінополіуретан - 20 мм, Екструдований пінополістирол - 30 мм, Пінопласт - 40 мм, Мінеральна вата - 45 мм, Полістиролбетон - 120 мм, Дерев`яний брус - 180 мм, Червона цегла - 560 мм, Бетонний блок – 1300 мм'
                    },
                    'description-info_img-0' : {
                        'ru' : 'Жилые дома',
                        'uk' : 'Житлові будинки',
                    },
                    'description-info_img-1': {
                        'ru' : 'Коммерческие здания',
                        'uk' : 'Комерційні будинки',
                    },
                    'description-info_img-2': {
                        'ru' : 'Резервуары и цестерны',
                        'uk' : 'Резервуари та цестерни',
                    },
                    'description-info_img-3': {
                        'ru' : 'Склады и ангары',
                        'uk' : 'Склади та ангари',
                    },
                },
            }
        },
        lng : ['ru', 'uk']
    });
});



