const infoSlide = [
    {
        order: 1,
        img: ['./img/slide/1/slide-1.png', './img/slide/1/slide-2.png', './img/slide/1/slide-3.png'],
        type: 'Кровля загородного дома',
        info: ['Площадь утепление - 130м2', 'Срок выполнения - 8 часов', 'Применяемый материал - Экотермикс 600', 'Толщина утеления - 150мм'],
        btn: 'Рассчитать стоимость'
    },
    {
        order: 2,
        img: ['./img/slide/1/slide-1.png', './img/slide/1/slide-2.png', './img/slide/1/slide-3.png'],
        type: 'Овцеферма',
        info: ['Площадь утепление - 470м2', 'Срок выполнения - 1 день', 'Применяемый материал - Экотермикс 600', 'Толщина утеления - 50мм'],
        btn: 'Рассчитать стоимость'
    },
    {
        order: 3,
        img: ['./img/slide/1/slide-1.png', './img/slide/1/slide-2.png', './img/slide/1/slide-3.png'],
        type: 'Купольный дом',
        info: ['Площадь утепление - 280м2', 'Срок выполнения - 2 дня', 'Применяемый материал - Экотермикс 600', 'Толщина утеления - 100мм'],
        btn: 'Рассчитать стоимость'
    }
    // {

    // },
    // {

    // },
]

export default infoSlide;