const infoDescription = [
    {
        info_ru: ['Активно применяется в Канаде, США и Европе.', 'ППУ экологически безопасен.', 'Утепление пенополиуретаном не требует применения крепежей.', 'У пенополиуретана самая низкая теплопроводность среди утеплителей.', 'ППУ– это негорючий материал.', 'Долговечность пенополиуретана сравнима со сроком жизни Вашего дома и составляет не менее 50 лет.', 'Бесшовный слой ППУ без стыков позволяет в 2 раза уменьшить потери тепла.', 'Пенополиуретаном можно утеплить абсолютно любую конструкцию.', 'На сегодняшний день ППУ — самый энергоэффективный утеплитель в мире.'],
        info_ua: ['Активно застосовується у Канаді, США та Європі.', 'ППУ є екологічно безпечним.', 'Утеплення пінополіуретаном не потребує застосування кріплень.', 'У пінополіуретану найнижча теплопровідність серед утеплювачів.', 'ППУ – це негорючий матеріал.', 'Довговічність пінополіуретану можна порівняти з терміном життя Вашого будинку і становить не менше 50 років.', 'Безшовний шар ППУ без стиків дозволяє вдвічі зменшити втрати тепла.', 'Пінополіуретаном можна утеплити будь-яку конструкцію.Пенополиуретаном можно утеплить абсолютно любую конструкцию.', 'На сьогоднішній день ППУ — найенергоефективніший утеплювач у світі.'],
    }
]

export default infoDescription;
















