const infoAccordion = [
    {
        order: 1,
        FAQ: [
            {
                title: 'Можно ли самому нанести ППУ?',
                info: 'Метод предполагает наличие профессионального оборудования высокого давления и знаний по напылению ППУ. Лучше пригласить профессионалов и сэкономить деньги и время.',
            },
            {
                title: 'Пенополеуритан горит?',
                info: 'Пенополиуретан не поддерживает горение, т е. является самозатухающим материалом с классом горючести Г2.',
            },
            {
                title: 'Заводятся ли насекомые и грызуны?',
                info: 'Грызуны и муравьи не используют материал в качестве пищи. Прогрызть нору способны, но жить там не будут, так как в ппу находится углекислый газ и нора становиться газовой термокамерой.',
            },
            {
                title: 'ППУ Безопасный материал?',
                info: 'Пенополиуретан является одним из самых безопасных и экологически чистых. Это подтверждено множеством испытаний и многолетней практикой эксплуатации этого утеплителя. Материал разрешен для использования в конструкции холодильников и бойлеров, находящихся в контакте с пищевыми продуктами.',
            },
        ]
    },
    {
        order: 2,
        FAQ: [
            {
                title: 'Как правильно выбрать плотность?',
                info: 'Плотность пенополиуретана выбирается исходя из утепляемой конструкции. Лучше свяжитесь с нашими специалистами, они подберут плотность под задачу.',
            },
            {
                title: 'Какой срок службы ППУ?',
                info: 'Плотность пенополиуретана выбирается исходя из утепляемой конструкции. Лучше свяжитесь с нашими специалистами, они подберут плотность под задачу.',
            },
            {
                title: 'ППУ боится воды?',
                info: 'Воды не боится. Даже открытоячеистый ппу при комнатной температуре высохнет и будет работать. Но устранять вопросы гидроизоляции должен не утеплитель.',
            },
            {
                title: 'Минусы ППУ?',
                info: 'Самый главный минус это технологичность. На втором месте идет разрушение от ультрафиолетовых лучей. При теплоизоляции снаружи надо обязательно предусмотреть его защиту.',
            },
        ]
    }
];

export default infoAccordion;