const infoAccordion = [
    {
        order: 1,
        FAQ_ru: [
            {
                title: 'Можно ли самому нанести ППУ?',
                info: 'Метод предполагает наличие профессионального оборудования высокого давления и знаний по напылению ППУ. Лучше пригласить профессионалов и сэкономить деньги и время.',
            },
            {
                title: 'Пенополеуритан горит?',
                info: 'Пенополиуретан не поддерживает горение, т е. является самозатухающим материалом с классом горючести Г2.',
            },
            {
                title: 'Заводятся ли насекомые и грызуны?',
                info: 'Грызуны и муравьи не используют материал в качестве пищи. Прогрызть нору способны, но жить там не будут, так как в ппу находится углекислый газ и нора становиться газовой термокамерой.',
            },
            {
                title: 'ППУ Безопасный материал?',
                info: 'Пенополиуретан является одним из самых безопасных и экологически чистых. Это подтверждено множеством испытаний и многолетней практикой эксплуатации этого утеплителя. Материал разрешен для использования в конструкции холодильников и бойлеров, находящихся в контакте с пищевыми продуктами.',
            },
        ],
        FAQ_ua: [
            {
                title: 'Чи можна самому нанести ППУ?',
                info: 'Метод передбачає наявність професійного обладнання високого тиску та знань із напилення ППУ. Краще запросити професіоналів та заощадити гроші та час.',
            },
            {
                title: 'Чи горить пінополеуритан?',
                info: 'Пінополіуретан не підтримує горіння, тобто є самозагасаючим матеріалом з класом горючості Г2.',
            },
            {
                title: 'Чи заводяться комахи та гризуни?',
                info: 'Гризуни та мурахи не використовують матеріал як їжу. Прогризти нору здатні, але жити там не будуть, тому що у ппу знаходиться вуглекислий газ і нора ставати газовою термокамерою.',
            },
            {
                title: 'ППУ Безпечний матеріал?',
                info: 'Пінополіуретан є одним з найбезпечніших та екологічно чистих. Це підтверджено безліччю випробувань та багаторічною практикою експлуатації цього утеплювача. Матеріал дозволено для використання в конструкції холодильників та бойлерів, що перебувають у контакті з харчовими продуктами.',
            },
        ]
    },
    {
        order: 2,
        FAQ_ru: [
            {
                title: 'Как правильно выбрать плотность?',
                info: 'Плотность пенополиуретана выбирается исходя из утепляемой конструкции. Лучше свяжитесь с нашими специалистами, они подберут плотность под задачу.',
            },
            {
                title: 'Какой срок службы ППУ?',
                info: 'Плотность пенополиуретана выбирается исходя из утепляемой конструкции. Лучше свяжитесь с нашими специалистами, они подберут плотность под задачу.',
            },
            {
                title: 'ППУ боится воды?',
                info: 'Воды не боится. Даже открытоячеистый ппу при комнатной температуре высохнет и будет работать. Но устранять вопросы гидроизоляции должен не утеплитель.',
            },
            {
                title: 'Минусы ППУ?',
                info: 'Самый главный минус это технологичность. На втором месте идет разрушение от ультрафиолетовых лучей. При теплоизоляции снаружи надо обязательно предусмотреть его защиту.',
            },
        ],
        FAQ_ua: [
            {
                title: 'Як правильно обрати густину?',
                info: 'Щільність пінополіуретану вибирається виходячи з конструкції, що утеплюється. Краще зв`яжіться з нашими фахівцями, вони підберуть густину під завдання.',
            },
            {
                title: 'Який термін служби ППУ?',
                info: 'Час служби понад 50 років, у той час як мінеральна вата погіршить теплоізоляційні характеристики в 2 рази вже через 5-8 років експлуатації та вимагатиме заміни.',
            },
            {
                title: 'ППУ боїться води?',
                info: 'Води не боїться. Навіть відкритокомірчастий ппу при кімнатній температурі висохне і працюватиме. Але усувати питання гідроізоляції має не утеплювач.',
            },
            {
                title: 'Мінуси ППУ?',
                info: 'Найголовніший мінус – це технологічність. На другому місці йде руйнація від ультрафіолетового проміння. При теплоізоляції зовні необхідно обов`язково передбачити його захист.',
            },
        ]
    }
];

export default infoAccordion;