const objLang = {
    'title' : {
        'ru' : 'Теплый дом - Утепление пенополиуретаном',
        'ua' : 'Теплий будинок - Утеплення пінополіуретаном'
    },
    'work' : {
        'ru' : 'Работа',
        'ua' : 'Робота',
    },
    'contacts' : {
        'ru' : 'Контакты',
        'ua' : 'Контакти',
    },
    'btn_calculate' : {
        'ru' : 'Рассчитать стоимость',
        'ua' : 'Розрахувати вартість',
    },
    'btn_connection' : {
        'ru' : 'Оставить заявку',
        'ua' : 'Залишити заявку',
    },
    'kinds-work_title' : {
        'ru' : 'Что можно утеплить при помощи ППУ',
        'ua' : 'Що можна утеплити за допомогою ППУ',
    },
    'description-info_text-0' : {
        'ru' : 'Жилые дома',
        'ua' : 'Житлові будинки',
    },
    'description-info_text-1' : {
        'ru' : 'Коммерческие здания',
        'ua' : 'Комерційні будинки',
    },
    'description-info_text-2' : {
        'ru' : 'Резервуары и цестерны',
        'ua' : 'Резервуари та цестерни',
    },
    'description-info_text-3' : {
        'ru' : 'Склады и ангары',
        'ua' : 'Склади та ангари',
    },
    'slide_info-title-0' : {
        'ru' : 'Кровля загородного дома',
        'ua' : 'Покрівля заміського будинку',
    },
    'slide_info-title-1' : {
        'ru' : 'Ферма',
        'ua' : 'Ферма',
    },
    'slide_info-title-2' : {
        'ru' : 'Купольный дом',
        'ua' : 'Купольний дiм',
    },
    'content-header_info' : {
        'ru' : 'Снижение расходов на отопление дома на 40%',
        'ua' : 'Зниження витрат на опалення будинку на 40%',
    },
    'content-header_question' : {
        'ru' : 'Почему стоит выбрать пенополиуретан (ППУ)?',
        'ua' : 'Чому варто обрати пінополіуретан (ППУ)?',
    },
    'questions-content_title' : {
        'ru' : 'Часто задаваемые вопросы',
        'ua' : 'Часті питання',
    },
    'content_intro-title' : {
        'ru' : 'Нет времени разбираться?',
        'ua' : 'Нема часу розбиратися?',
    },
    'content_intro-help' : {
        'ru' : 'Наши специалисты помогут',
        'ua' : 'Наші спеціалісти допоможуть',
    },
    'btn_order': {
        'ru': 'Связаться в Telegram',
        'ua' : 'Зв`язатися у Telegram',
    },
    'btn_write': {
        'ru': 'Связаться в Viber',
        'ua' : 'Зв`язатися у Viber',
    },
    'content-form_intro-help' : {
        'ru': 'Контакты',
        'ua' : 'Контакти',
    },
    'content-form_intro-phone' : {
        'ru': 'Контакты',
        'ua' : 'Телефон',
    },
    'content-form_intro-mail' : {
        'ru': 'Контакты',
        'ua' : 'Пошта',
    },
    'content-form_intro-form' : {
        'ru': 'Оставьте заявку',
        'ua' : 'Залишіть заявку',
    },
    'content-form_intro-warning' : {
        'ru': 'Отправляя запрос вы соглашаетесь с политикой конфиденциальности',
        'ua' : 'Надсилаючи запит ви погоджуєтеся з політикою конфіденційності',
    },
    'content-form_intro-btn' : {
        'ru': 'Отправить',
        'ua' : 'Надiслати',
    }
}

export default objLang;