const objLang = {
    'title' : {
        'ru' : 'Теплый дом - Утепление пенополиуретаном',
        'ua' : 'Теплий будинок - Утеплення пінополіуретаном'
    },
    'work' : {
        'ru' : 'Работа',
        'ua' : 'Робота',
    },
    'contacts' : {
        'ru' : 'Контакты',
        'ua' : 'Контакти',
    },
    'btn_calculate' : {
        'ru' : 'Рассчитать стоимость',
        'ua' : 'Розрахувати вартість',
    },
    'btn_connection' : {
        'ru' : 'Оставить заявку',
        'ua' : 'Залишити заявку',
    },
    'kinds-work_title' : {
        'ru' : 'Что можно утеплить при помощи ППУ',
        'ua' : 'Що можна утеплити за допомогою ППУ',
    },
    'description-info_text': {
        0 : {
            'ru' : 'Жилые дома',
            'ua' : 'Житлові будинки',
        },
        1 : {
            'ru' : 'Коммерческие здания',
            'ua' : 'Комерційні будинки',
        },
        2 : {
            'ru' : 'Резервуары и цестерны',
            'ua' : 'Резервуари та цестерни',
        },
        3 : {
            'ru' : 'Склады и ангары',
            'ua' : 'Склади та ангари',
        }
    }
}

export default objLang;